Seanachan/Microprocessor-PIC18F/final_exam.X/template_with_timer.c
// CONFIG1H
#pragma config OSC = INTIO67 // Oscillator Selection bits (HS oscillator)
#pragma config FCMEN = OFF   // Fail-Safe Clock Monitor Enable bit (Fail-Safe Clock Monitor disabled)
#pragma config IESO = ON     // Internal/External Oscillator Switchover bit (Oscillator Switchover mode disabled)

// CONFIG2L
#pragma config PWRT = OFF      // Power-up Timer Enable bit (PWRT disabled)
#pragma config BOREN = SBORDIS // Brown-out Reset Enable bits (Brown-out Reset enabled in hardware only (SBOREN is disabled))
#pragma config BORV = 3        // Brown Out Reset Voltage bits (Minimum setting)

// CONFIG2H
#pragma config WDT = OFF // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 1 // Watchdog Timer Postscale Select bits (1:1)

// CONFIG3H
#pragma config CCP2MX = PORTC // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = ON    // PORTB A/D Enable bit (PORTB<4:0> pins are configured as analog input channels on Reset)
#pragma config LPT1OSC = OFF  // Low-Power Timer1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON     // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)

// CONFIG4L
#pragma config STVREN = ON // Stack Full/Underflow Reset Enable bit (Stack full/underflow will cause Reset)
#pragma config LVP = OFF   // Single-Supply ICSP Enable bit (Single-Supply ICSP enabled)
#pragma config XINST = OFF // Extended Instruction Set Enable bit (Instruction set extension and Indexed Addressing mode disabled (Legacy mode))

// CONFIG5L
#pragma config CP0 = OFF // Code Protection bit (Block 0 (000800-001FFFh) not code-protected)
#pragma config CP1 = OFF // Code Protection bit (Block 1 (002000-003FFFh) not code-protected)
#pragma config CP2 = OFF // Code Protection bit (Block 2 (004000-005FFFh) not code-protected)
#pragma config CP3 = OFF // Code Protection bit (Block 3 (006000-007FFFh) not code-protected)

// CONFIG5H
#pragma config CPB = OFF // Boot Block Code Protection bit (Boot block (000000-0007FFh) not code-protected)
#pragma config CPD = OFF // Data EEPROM Code Protection bit (Data EEPROM not code-protected)

// CONFIG6L
#pragma config WRT0 = OFF // Write Protection bit (Block 0 (000800-001FFFh) not write-protected)
#pragma config WRT1 = OFF // Write Protection bit (Block 1 (002000-003FFFh) not write-protected)
#pragma config WRT2 = OFF // Write Protection bit (Block 2 (004000-005FFFh) not write-protected)
#pragma config WRT3 = OFF // Write Protection bit (Block 3 (006000-007FFFh) not write-protected)

// CONFIG6H
#pragma config WRTC = OFF // Configuration Register Write Protection bit (Configuration registers (300000-3000FFh) not write-protected)
#pragma config WRTB = OFF // Boot Block Write Protection bit (Boot block (000000-0007FFh) not write-protected)
#pragma config WRTD = OFF // Data EEPROM Write Protection bit (Data EEPROM not write-protected)

// CONFIG7L
#pragma config EBTR0 = OFF // Table Read Protection bit (Block 0 (000800-001FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR1 = OFF // Table Read Protection bit (Block 1 (002000-003FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR2 = OFF // Table Read Protection bit (Block 2 (004000-005FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR3 = OFF // Table Read Protection bit (Block 3 (006000-007FFFh) not protected from table reads executed in other blocks)

// CONFIG7H
#pragma config EBTRB = OFF // Boot Block Table Read Protection bit (Boot block (000000-0007FFh) not protected from table reads executed in other blocks)

#include <ctype.h>
// #include <pic18f4520.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <xc.h>
#define _XTAL_FREQ 4000000
#define STR_MAX 100
#define VR_MAX ((1 << 10) - 1)
// #define delay(t) __delay_ms(t * 1000);

char buffer[STR_MAX];
int buffer_size = 0;
bool btn_interr = false;
// t0_blink_half_ticks = 4 -> full period 1.0 s | 2 -> 0.25 s | 1 -> 0.125 s
// t1_blink_half_ticks = 10 -> full period 1.0 s | 2 -> 0.25 s | 1 -> 0.125 s
unsigned char t0_blink_half_ticks = 4;
unsigned char t0_tick = 0;
unsigned char t1_blink_half_ticks = 4;
unsigned char t1_tick = 0;

// My Variables

// ----- State machine for 3-LED pattern -----
void set_LED(int value);

// ---------------- Uart --------------------

void putch(char data)
{ // Output on Terminal
    if (data == '\n' || data == '\r')
    {
        while (!TXSTAbits.TRMT)
            ;
        TXREG = '\r';
        while (!TXSTAbits.TRMT)
            ;
        TXREG = '\n';
    }
    else
    {
        while (!TXSTAbits.TRMT)
            ;
        TXREG = data;
    }
}

void ClearBuffer()
{
    for (int i = 0; i < STR_MAX; i++)
        buffer[i] = '\0';
    buffer_size = 0;
}

void MyusartRead()
{
    char data = RCREG;
    if (!isprint(data) && data != '\r')
        return;
    buffer[buffer_size++] = data;
    putch(data);
}

int GetString(char *str)
{
    if (buffer[buffer_size - 1] == '\r')
    {
        buffer[--buffer_size] = '\0';
        strcpy(str, buffer);
        ClearBuffer();
        return 1;
    }
    else
    {
        str[0] = '\0';
        return 0;
    }
}

void __interrupt(low_priority) Lo_ISR(void)
{
    if (RCIF)
    {
        if (RCSTAbits.OERR)
        {
            CREN = 0;
            Nop();
            CREN = 1;
        }

        MyusartRead();
    }

    // process other interrupt sources here, if required
    return;
}

// ---------------- Settings --------------------

void Initialize(void)
{
    // Configure oscillator
    OSCCONbits.IRCF = 0b110; // 4 MHz
    // Configure ADC
    TRISAbits.RA0 = 1;        // Set RA0 as input port
    ADCON1bits.PCFG = 0b1110; // AN0 as analog input
    ADCON0bits.CHS = 0b0000;  // Select AN0 channel
    ADCON1bits.VCFG0 = 0;     // Vref+ = Vdd
    ADCON1bits.VCFG1 = 0;     // Vref- = Vss
    ADCON2bits.ADCS = 0b000;  // ADC clock Fosc/2
    ADCON2bits.ACQT = 0b001;  // 2Tad acquisition time
    ADCON0bits.ADON = 1;      // Enable ADC
    ADCON2bits.ADFM = 1;      // Right justified

    // Configure servo (PWM)
    T2CONbits.TMR2ON = 0b1;     // Timer2 on
    T2CONbits.T2CKPS = 0b11;    // Prescaler 16
    CCP1CONbits.CCP1M = 0b1100; // PWM mode
    PR2 = 0x9b;                 // Set PWM period

    TRISCbits.TRISC2 = 0;

    // Configure CCP2 for LED analog on RC1
    CCP2CONbits.CCP2M = 0b1100; // PWM mode
    TRISCbits.TRISC1 = 0;       // RC1 as output (LED)

    // Configure I/O ports
    TRISA &= 0xC1; // Set RA1-RA5 as outputs for LED
    TRISB = 1;     // RB0 as input for button
    TRISC = 0;     // PORTC as output for servo
    LATA &= 0xC1;  // Clear RA1-RA5
    LATC = 0;      // Clear PORTC

    // Configure interrupts
    INTCONbits.INT0IF = 0; // Clear INT0 flag
    INTCONbits.INT0IE = 1; // Enable INT0 interrupt
    PIE1bits.ADIE = 1;     // Enable ADC interrupt
    PIR1bits.ADIF = 0;     // Clear ADC flag
    INTCONbits.PEIE = 1;   // Enable peripheral interrupt
    INTCONbits.GIE = 1;    // Enable global interrupt
    RCONbits.IPEN = 1;     // enable Interrupt Priority mode
    INTCONbits.GIEH = 1;   // enable high priority interrupt
    INTCONbits.GIEL = 1;   // disable low priority interrupt

    // Configure UART
    /*
           TODObasic
           Serial Setting
        1.   Setting Baud rate
        2.   choose sync/async mode
        3.   enable Serial port (configures RX/DT and TX/CK pins as serial port pins)
        3.5  enable Tx, Rx Interrupt(optional)
        4.   Enable Tx & RX
    */
    TRISCbits.TRISC6 = 1; // RC6(TX) : Transmiter set 1 (output)
    TRISCbits.TRISC7 = 1; // RC7(RX) : Receiver set 1   (input)

    // Setting Baud rate
    // Baud rate = 1200 (Look up table)
    TXSTAbits.SYNC = 0;    // Synchronus or Asynchronus
    BAUDCONbits.BRG16 = 0; // 16 bits or 8 bits
    TXSTAbits.BRGH = 0;    // High Baud Rate Select bit
    SPBRG = 51;            // Control the period

    // Serial enable
    RCSTAbits.SPEN = 1; // Enable asynchronus serial port (must be set to 1)
    PIR1bits.TXIF = 0;  // Set when TXREG is empty
    PIR1bits.RCIF = 0;  // Will set when reception is complete
    TXSTAbits.TXEN = 1; // Enable transmission
    RCSTAbits.CREN = 1; // Continuous receive enable bit, will be cleared when error occured
    PIE1bits.TXIE = 0;  // Wanna use Interrupt (Transmit)
    IPR1bits.TXIP = 0;  // Interrupt Priority bit
    PIE1bits.RCIE = 1;  // Wanna use Interrupt (Receive)
    IPR1bits.RCIP = 0;  // Interrupt Priority bit
    /* Transmitter (output)
     TSR   : Current Data
     TXREG : Next Data
     TXSTAbits.TRMT will set when TSR is empty
    */
    /* Reiceiver (input)
     RSR   : Current Data
     RCREG : Correct Data (have been processed) : read data by reading the RCREG Register
    */

    // Start ADC conversion
    ADCON0bits.GO = 1;

    // --------- Timer0: 125 ms tick ---------
    T0CONbits.T08BIT = 0;   // 16-bit timer
    T0CONbits.T0CS = 0;     // clock source = internal instruction clock (Fosc/4)
    T0CONbits.T0SE = 0;     // increment on low-to-high (don't care for internal)
    T0CONbits.PSA = 0;      // use prescaler
    T0CONbits.T0PS = 0b111; // prescaler 1:256
    T0CONbits.TMR0ON = 0;   // stop Timer0
    // Fosc = 4 MHz → Fcy = 1 MHz → Timer0 tick = 1 µs * 256 = 256 µs
    // N = 65536-65047 = 489 counts
    //   125 ms / 256 µs ≈ 488 counts
    //   N = 125 ms / 256 µs ≈ 488 counts
    //   preload = 65536 - 488 = 65048 = 0xFE68
    TMR0H = 0xFE;
    TMR0L = 0x68;

    INTCONbits.TMR0IF = 0;
    INTCONbits.TMR0IE = 1;  // enable Timer0 interrupt
    INTCON2bits.TMR0IP = 1; // high priority

    // -------- Timer1: 10 ms tick --------
    T1CONbits.TMR1CS = 0;    // clock source = Fosc/4 (1 MHz at 4 MHz Fosc)
    T1CONbits.T1CKPS = 0b11; // prescaler 1:8 -> tick = 8 µs
    T1CONbits.RD16 = 1;      // 16-bit read/write

    // 0.1 s / 8 µs = 12500 counts
    // preload = 65536 - 12500 = 53036 = 0xCF2C
    TMR1H = 0xCF;
    TMR1L = 0x2C;

    PIR1bits.TMR1IF = 0;
    PIE1bits.TMR1IE = 1;  // enable Timer1 interrupt
    T1CONbits.TMR1ON = 0; // stop Timer1

    // -------- Timer3: 10 ms tick --------
    T1CONbits.TMR3CS = 0;    // clock source = Fosc/4 (1 MHz at 4 MHz Fosc)
    T1CONbits.T3CKPS = 0b11; // prescaler 1:8 -> tick = 8 µs
    T1CONbits.RD16 = 1;      // 16-bit read/write

    // 0.1 s / 8 µs = 12500 counts
    // preload = 65536 - 12500 = 53036 = 0xCF2C
    TMR3H = 0xCF;
    TMR3L = 0x2C;

    PIR1bits.TMR3IF = 0;
    PIE1bits.TMR3IE = 1;  // enable Timer3 interrupt
    T3CONbits.TMR3ON = 0; // stop Timer3
}

// ---------------- OOP --------------------

int get_LED()
{
    return (LATA >> 1);
}

void set_LED(int value)
{
    LATA = (value << 1);
}

void set_LED_separately(int a, int b, int c, int d, int e)
{
    LATA = (a << 5) + (b << 4) + (c << 3) + (d << 2) + (e << 1);
}

void set_LED_analog(int value)
{
    CCPR2L = (value >> 2);
    CCP2CONbits.DC2B = (value & 0b11);
}

// Timer on/off functions
void timer0_on_off(unsigned char on_off)
{
    // Timer 0 Start
    T0CONbits.TMR0ON = on_off; // start Timer0
}
void timer1_on_off(unsigned char on_off)
{
    // Timer 1 Start
    T1CONbits.TMR1ON = on_off; // start Timer1
}

void timer3_on_off(unsigned char on_off)
{
    // Timer 3 Start
    T3CONbits.TMR3ON = on_off; // start Timer3
}
// Servo functions
int current_servo_angle = 0;
int get_servo_angle()
{
    // double duty_cycle = ((CCPR1L << 2) + CCP1CONbits.DC1B) * 4;
    // return (int)((duty_cycle - 500) / (2400 - 500) * 180 - 90);
    return current_servo_angle;
}

int set_servo_angle(int angle)
{
    int current = (CCPR1L << 2) + CCP1CONbits.DC1B;
    int target = (int)((500 + (double)(angle + 90) / 180 * (2400 - 500)) / 8 / 4) * 8; // angle to pwn
    btn_interr = false;
    while (current != target)
    {
        if (btn_interr)
            return -1;
        if (current < target)
            current++;
        else
            current--;

        CCPR1L = (current >> 2);
        CCP1CONbits.DC1B = (current & 0b11);
        __delay_ms(1);
    }
    current_servo_angle = angle;
    return 0;
}

// Variable resistor

int VR_value_to_servo_angle(int value, int min_deg, int max_deg)
{
    int vr = value;
    if (vr < 0)
        vr = 0;
    else if (vr > VR_MAX)
        vr = VR_MAX; // VR_MAX = 1023

    long span = (long)(max_deg - min_deg);          // total angle range
    long angle = (span * vr + VR_MAX / 2) / VR_MAX; // scaled, with rounding

    // return (int)(((double)value / VR_MAX * 180) - 90);
    return (int)(min_deg + angle);
}
int VR_value_to_L

    int
    VR_value_to_LED_analog(int value)
{
    return value;
}

void variable_register_changed(int value);
void button_pressed();
void timer0_time_out();
void timer1_time_out();
void timer3_time_out();

void __interrupt(high_priority) H_ISR()
{
    if (PIR1bits.ADIF)
    { // Handle variable register interrupt
        int value = (ADRESH << 8) + ADRESL;
        variable_register_changed(value);
        PIR1bits.ADIF = 0;
        __delay_ms(5);
    }

    if (INTCONbits.INT0IF)
    { // Handle button interrupt
        button_pressed();
        __delay_ms(50); // bouncing problem
        btn_interr = true;
        INTCONbits.INT0IF = 0;
    }
    if (INTCONbits.TMR0IF)
    { // Handle Timer0 overflow interrupt
        // Clear Timer0 interrupt flag
        INTCONbits.TMR0IF = 0;
        // Reload Timer0 for next overflow
        // approx 0.25 s
        TMR0H = 0xFC;
        TMR0L = 0x2F;

        t0_tick++;
        if (t0_tick >= t0_blink_half_ticks)
        {
            t0_tick = 0;
            timer0_time_out();
        }
    }
    if (PIR1bits.TMR1IF)
    { // Handle Timer1 overflow interrupt
        // Clear Timer1 interrupt flag
        PIR1bits.TMR1IF = 0;
        // Reload Timer0 for next overflow
        // Approx 0.1 s
        TMR1H = 0xCF;
        TMR1L = 0x2C;

        t1_tick++;
        if (t1_tick >= t1_blink_half_ticks)
        {
            t1_tick = 0;
            timer1_time_out();
        }
    }
    if (PIR1bits.TMR3IF)
    { // Handle Timer3 overflow interrupt
        // Clear Timer3 interrupt flag
        PIR1bits.TMR3IF = 0;
        // Reload Timer0 for next overflow
        // Approx 0.1 s
        TMR3H = 0xCF;
        TMR3L = 0x2C;

        t3_tick++;
        if (t3_tick >= t3_blink_half_ticks)
        {
            t3_tick = 0;
            timer3_time_out();
        }
    }
}

int delay(double sec)
{
    btn_interr = false;
    for (int i = 0; i < sec * 1000 / 10; i++)
    {
        if (btn_interr)
            return -1;
        __delay_ms(10);
    }
    return 0;
}

// --------------- TODO ------------------

void button_pressed()
{
    // Do sth when the button is pressed
    /* Example:
     * set_LED(get_LED() + 1);
     */
}

void variable_register_changed(int value)
{ // value: 0 ~ 1023
  // Do sth when the variable register changes
    /* Example:
     * set_servo_angle(VR_value_to_servo_angle(value));
     * set_LED_analog(VR_value_to_LED_analog(value));
     * printf("%d\n", value); // print the variable register value on uart terminal
     */
}

void keyboard_input(char *str)
{ // get line from keyboard: this function will be called after you click enter
  // Do sth when typing on keyboard
    /* Example:
        if(strcmp(str, "mode1") == 0) {
            mode = 1;
        } else if(strcmp(str, "mode2") == 0) {
            mode = 2;
        }
     */
}
void timer0_time_out()
{
    // Do something when timer0 overflows
}
void timer1_time_out()
{
    // Do something when timer1 overflows
}

void timer3_time_out()
{
    // Do something when timer3 overflows
}

void main()
{
    Initialize();
    /* Usage:
     * set_servo_angle(-90); // input: -90 ~ 90, return value: -1 represents interrupt with button press, else 0
     * get_servo_angle(); // return value: -90 ~ 90
     *
     * set_LED(5); // 5 = 0b101, set LED1 and LED3 on, LED2 off
     * get_LED(); // return value: an integer, bit 0 -> LED1, bit 1 -> LED2, bit 2 -> LED3
     *
     * set_LED_separately(1, 1, 0); // set LED1 and LED2 on, LED3 off
     * set_LED_analog(512); // input: 0 ~ 1023, represent brightness. NOTICE: LED need to be plugged into the CCP1 pin.
     *
     * VR_value_to_servo_angle(1024); // return value: -90 ~ 90. Change the variable register value to servo angle
     * VR_value_to_LED_analog(1024); // return value: 0 ~ 1023. Change the variable register value to LED brightness
     *
     * delay(1); // delay 1 second, return value: -1 represents interrupt with button press, else 0
     *
     * printf(); // print on uart terminal
     */

    char str[STR_MAX];

    while (1)
    {
        // Do sth in main

        if (GetString(str))
            keyboard_input(str);
        if (ADCON0bits.GO == 0)
            ADCON0bits.GO = 1;
    }
}